
Internet Engineering Task Force                       C. Perkins, editor
INTERNET DRAFT                                                       IBM
                                                         21 October 1994


                          IP Mobility Support
                  draft-ietf-mobileip-protocol-07.txt


Abstract

   This document specifies protocol enhancements that allow transparent
   routing of IP datagrams to mobile node in the Internet.  The
   mobile node is always identified by its home address, regardless of
   its current point of attachment to the Internet.  While situated
   away from its home, a mobile node is also associated with a
   care-of address, which provides information about its current point
   of attachment to the Internet.  The protocol provides for registering
   the care-of address with a home agent.  The home agent sends traffic
   destined for the mobile node through a tunnel to the care-of address.


Status of This Memo

   This document is a submission to the Mobile-IP Working Group of the
   Internet Engineering Task Force (IETF). Comments should be submitted
   to the mobile-ip@sunroof.eng.sun.com mailing list.

   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet Drafts are working
   documents of the Internet Engineering Task Force (IETF), its Areas,
   and its Working Groups.  Note that other groups may also distribute
   working documents as Internet Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months, and may be updated, replaced, or obsoleted by other documents
   at any time.  It is not appropriate to use Internet Drafts as
   reference material, or to cite them other than as a ``working draft''
   or ``work in progress.''

   To learn the current status of any Internet-Draft, please check
   the ``1id-abstracts.txt'' listing contained in the internet-drafts
   Shadow Directories on ds.internic.net (US East Coast), nic.nordu.net
   (Europe), ftp.isi.edu (US West Coast), or munnari.oz.au (Pacific
   Rim).








Perkins, editor              Expires 21 April 1994              [Page i]

Internet Draft            IP Mobility Support            21 October 1994




                                Contents



Abstract                                                               i

Status of This Memo                                                    i

 1. Introduction                                                       1
     1.1. Requirements  . . . . . . . . . . . . . . . . . . . . . .    2
     1.2. Goals . . . . . . . . . . . . . . . . . . . . . . . . . .    2
     1.3. Assumptions . . . . . . . . . . . . . . . . . . . . . . .    3
     1.4. Specification Language  . . . . . . . . . . . . . . . . .    3
     1.5. Terminology . . . . . . . . . . . . . . . . . . . . . . .    4

 2. Agent Discovery                                                    6
     2.1. Authentication  . . . . . . . . . . . . . . . . . . . . .    6
     2.2. Agent Solicitation  . . . . . . . . . . . . . . . . . . .    6
     2.3. Agent Advertisement . . . . . . . . . . . . . . . . . . .    7

 3. Registration                                                       9
     3.1. Authentication  . . . . . . . . . . . . . . . . . . . . .   10
     3.2. Registration Request  . . . . . . . . . . . . . . . . . .   10
     3.3. Registration Reply  . . . . . . . . . . . . . . . . . . .   12

 4. Mobility Message Extensions                                       14
     4.1. Mobility Extension  . . . . . . . . . . . . . . . . . . .   15
     4.2. Home Address Extension  . . . . . . . . . . . . . . . . .   16
     4.3. Key Identifier  . . . . . . . . . . . . . . . . . . . . .   17
     4.4. Mobile-Home Authentication Extension  . . . . . . . . . .   17
     4.5. Minimal Encapsulation Extension . . . . . . . . . . . . .   18

 5. Forwarding Datagrams to the Mobile Node                           19
     5.1. IP in IP Encapsulation  . . . . . . . . . . . . . . . . .   19
     5.2. Minimal Encapsulation . . . . . . . . . . . . . . . . . .   19

 6. Mobile Node Considerations                                        22
     6.1. Configuration and Registration Tables . . . . . . . . . .   22
     6.2. Registration When Away From Home  . . . . . . . . . . . .   23
     6.3. Registration without a foreign agent  . . . . . . . . . .   23
     6.4. De-registration When At Home  . . . . . . . . . . . . . .   24
     6.5. Registration Replies  . . . . . . . . . . . . . . . . . .   25
     6.6. Registration Retransmission . . . . . . . . . . . . . . .   25
     6.7. Simultaneous Registrations  . . . . . . . . . . . . . . .   26
     6.8. Mobile Routers  . . . . . . . . . . . . . . . . . . . . .   26




Perkins, editor             Expires 21 April 1994              [Page ii]

Internet Draft            IP Mobility Support            21 October 1994


 7. Foreign Agent Considerations                                      27
     7.1. Configuration and Registration Tables . . . . . . . . . .   28
     7.2. Receiving Registration Requests . . . . . . . . . . . . .   28
     7.3. Receiving Registration Replies  . . . . . . . . . . . . .   28
     7.4. Decapsulation . . . . . . . . . . . . . . . . . . . . . .   29
     7.5. Mobility  . . . . . . . . . . . . . . . . . . . . . . . .   29

 8. Home Agent Considerations                                         30
     8.1. Configuration and Registration Tables . . . . . . . . . .   30
     8.2. Receiving Registration Requests . . . . . . . . . . . . .   30
     8.3. Simultaneous Registrations  . . . . . . . . . . . . . . .   31
     8.4. Registration Expiration . . . . . . . . . . . . . . . . .   31
     8.5. Encapsulation . . . . . . . . . . . . . . . . . . . . . .   32
     8.6. Mobility  . . . . . . . . . . . . . . . . . . . . . . . .   32

 9. Security Considerations                                           33
     9.1. Message Authentication Codes  . . . . . . . . . . . . . .   33
     9.2. Tunneling to Care-of Addresses  . . . . . . . . . . . . .   33
     9.3. Key management  . . . . . . . . . . . . . . . . . . . . .   34
     9.4. Picking good keys . . . . . . . . . . . . . . . . . . . .   34
     9.5. Privacy . . . . . . . . . . . . . . . . . . . . . . . . .   34
     9.6. Replay Protection for Registration Requests . . . . . . .   34

10. Acknowledgements                                                  35

 A. Gratuitous and Proxy ARP                                          36

 B. Link-Layer considerations                                         37
     B.1. Point-to-Point Link-Layers  . . . . . . . . . . . . . . .   37
     B.2. Multi-Point Link-Layers . . . . . . . . . . . . . . . . .   38

 C. TCP Considerations                                                38
     C.1. TCP Timers  . . . . . . . . . . . . . . . . . . . . . . .   38
     C.2. TCP Congestion Management . . . . . . . . . . . . . . . .   38

 D. Tunnel Management                                                 39

Chair's Address                                                       42

Editor's Address                                                      42











Perkins, editor             Expires 21 April 1994             [Page iii]

Internet Draft            IP Mobility Support            21 October 1994


1. Introduction

   Current versions of the Internet Protocol make an implicit assumption
   that a node's point of attachment remains fixed.  Datagrams are sent
   to a node based on the location information contained in the node's
   IP address.

   If a node moves while keeping its IP address unchanged, its network
   number will not reflect its new point of attachment.  The routing
   protocols will not be able to route datagrams to it correctly.

   This document defines new functions that allow a node to roam on the
   Internet, without changing its IP address.

   The following entities are defined:

      Mobile Node

         A host or router that changes its point of attachment from one
         network or subnetwork to another.

      Home Agent

         A router that maintains a registry of the current mobility
         bindings for that mobile node, and encapsulates datagrams for
         delivery to the mobile node while it is away from home.

      Foreign Agent

         A router that assists a locally reachable mobile node that is
         away from its home network.

      Care-of Address

         The care-of address terminates the end of a tunnel toward a
         mobile node.  Depending on the foreign network configuration,
         the care-of address may be either dynamically assigned to the
         mobile node or associated with a foreign agent.

   The following support services are defined:

      Agent Discovery

         Home agents and foreign agents advertise their availability
         on each link for which they provide service.  A newly arrived
         mobile node can send a solicitation on the link to learn if any
         prospective agents are present.




Perkins, editor              Expires 21 April 1994              [Page 1]

Internet Draft            IP Mobility Support            21 October 1994


      Registration

         When the mobile node is away from home, it registers a
         care-of address with a home agent.  Depending on its method of
         attachment, the mobile node will register either directly with
         a home agent, or through a foreign agent which forwards the
         registration to the home agent.

      Encapsulation

         Once a mobile node has registered a care-of address with its
         home agent, that home agent intercepts datagrams destined for
         the mobile node, builds another datagram with the intercepted
         datagram enclosed within, and forwards the resulting datagram
         to the entity at the care-of address.

      Decapsulation

         At the care-of address, the enclosed datagram is extracted.
         When the mobile node receives packets sent to its own
         care-of address, it decapsulates its own datagrams.  When the
         care-of address is associated with a foreign agent, the foreign
         agent decapsulates the datagrams.  If the datagram is addressed
         to a mobile node which the foreign agent is currently serving,
         it will deliver the datagram to the mobile node.


1.1. Requirements

   A mobile node using its home address shall be able to communicate
   with other nodes after having been disconnected from the Internet,
   and then reconnected at a different point of attachment.

   A mobile node shall continue to be capable of communicating directly
   with existing nodes which do not implement the mobility functions
   described in this document.

   A mobile node shall provide authentication in its registration
   messages.


1.2. Goals

   The mobile node's directly attached link is likely to be bandwidth
   limited.  Only a few administrative messages should be sent between a
   mobile node and an agent.  The size of these messages should be kept
   as short as possible.




Perkins, editor              Expires 21 April 1994              [Page 2]

Internet Draft            IP Mobility Support            21 October 1994


   As few messages as possible which duplicate functionality are sent
   on mobile links.  This is particularly important on wireless and
   congested links.


1.3. Assumptions

   The protocols defined in this document place no additional
   requirements on assignment of IP addresses.  That is, a mobile node
   will be assigned an IP address by the organization that owns the
   machine, and will be able to use that IP address regardless of the
   current point of attachment.

   It is assumed that mobile nodes are able to change their point of
   attachment to the Internet no more frequently than once per second.

   No protocol enhancements are required in hosts or routers that are
   not serving any of the mobility functions.  Similarly, no additional
   protocols are needed by a router (that is not acting as a home agent
   or a foreign agent) to route datagrams to or from a mobile node.

   It is assumed that IP datagrams are routed to a destination without
   regard to the source of the datagram.


1.4. Specification Language

   In this document, several words are used to signify the requirements
   of the specification.  These words are often capitalized.

      MUST               This word, or the adjective "required", means
                         that the definition is an absolute requirement
                         of the specification.

      MUST NOT           This phrase means that the definition is an
                         absolute prohibition of the specification.

      SHOULD             This word, or the adjective "recommended",
                         means that there may exist valid reasons in
                         particular circumstances to ignore this item,
                         but the full implications must be understood
                         and carefully weighed before choosing a
                         different course.

      MAY                This word, or the adjective "optional", means
                         that this item is one of an allowed set of
                         alternatives.  An implementation which does
                         not include this option MUST be prepared to



Perkins, editor              Expires 21 April 1994              [Page 3]

Internet Draft            IP Mobility Support            21 October 1994


                         interoperate with another implementation which
                         does include the option.

      silently discard   The implementation discards the packet without
                         further processing, and without indicating an
                         error to the sender.  The implementation SHOULD
                         provide the capability of logging the error,
                         including the contents of the discarded packet,
                         and SHOULD record the event in a statistics
                         counter.


1.5. Terminology

   This document frequently uses the following terms:

      Agent Advertisement

         A periodic advertisement constructed by attaching a special
         extension to a Router Advertisement [5] message.

      Authentication Type

         This includes the algorithm and algorithm mode.  Note that a
         single algorithm (such as DES) might have several modes (for
         example, CBC and ECB)(see [16], [12]).

      Correspondent

         A peer with which a mobile node is communicating.  The
         correspondent may be either mobile or stationary.

      Home Address

         A long-term IP address that is assigned to a mobile node.  It
         remains unchanged regardless of where the node is attached
         to the Internet.  Datagrams addressed to the home address
         are intercepted by the home agent while the mobile node is
         registered with that home agent.

      Link

         A communication facility or medium over which nodes can
         communicate at the link layer; a link underlies the network
         layer.






Perkins, editor              Expires 21 April 1994              [Page 4]

Internet Draft            IP Mobility Support            21 October 1994


      Mobile Agent

         Either a home agent or a foreign agent.

      Mobility Binding

         The association of a home address with a care-of address, and
         the remaining lifetime of the association.

      Mobility Security Association

         The security relationship between two nodes that is used with
         Mobile IP protocol messages.  This relationship includes
         the authentication type (including algorithm and algorithm
         mode) and the secret (such as a shared key, or appropriate
         public/private key pair).

      Routing Prefix

         The high-order bits in an address, which are used by routers to
         locate a link for delivery of a datagram.

      Source Address

         An IP address belonging to the interface on which this message
         is sent.

























Perkins, editor              Expires 21 April 1994              [Page 5]

Internet Draft            IP Mobility Support            21 October 1994


2. Agent Discovery

   To communicate with a foreign or home agent, a mobile node must
   learn either the IP address or the link address of that agent.  It
   is assumed that a link-layer connection has been established between
   the agent and the mobile node.  The method used to establish such
   a link-layer connection is not specified in this document.  After
   establishing a link-layer connection, the mobile node learns whether
   there are any agents available.  If the address of any agent matches
   the mobile node's stored address for its home agent, the mobile node
   is at home.

   An agent which is not identified by a link-layer protocol MUST
   implement ICMP Router Discovery [5].  The Router Advertisements
   indicate whether the router is also a home agent or a foreign agent.

   When multiple methods of agent identification are in use, the
   mobile node SHOULD first attempt registration with routers sending
   Router Advertisements in preference to those sending link-layer
   advertisements.  This ordering maximizes the likelihood that the
   registration will be recognized, thereby minimizing the number of
   registration attempts.

   An administrative domain MAY require registration with a foreign
   agent even when another registration method is in use.  This facility
   (see subsection 4.1) is envisioned for service providers with packet
   filtering fire-walls, or visiting policies (such as accounting) which
   require exchanges of authorization.


2.1. Authentication

   No authentication is required for the advertisement and solicitation
   process.  These messages MAY be authenticated using the IP
   Authentication Header [1], which is external to the messages
   described here.  Further work on authentication of advertisement and
   solicitation is outside of the scope of this document.

   Whenever an externally authenticated message fails authentication,
   the message is silently discarded.


2.2. Agent Solicitation

   Every mobile node MUST implement ICMP Router Solicitation if it needs
   to obtain a care-of address in an agent advertisement.  However, the
   solicitation is only sent when no care-of address has been determined
   through a link-layer protocol or prior Router Advertisement.  Any



Perkins, editor              Expires 21 April 1994              [Page 6]

Internet Draft            IP Mobility Support            21 October 1994


   foreign agent or home agent which is not identified by a link- layer
   protocol MUST respond to ICMP Router Solicitation.

   The same procedures, defaults, and constants are used as described
   in "ICMP Router Discovery Messages" [5], except that the mobile
   node may solicit more often than once every three seconds and
   MAX_SOLICITATIONS does not apply for mobile nodes that are currently
   unconnected to any foreign agent.  A mobile node MAY send a
   solicitation once each MOBILE_SOLICITATION_INTERVAL (1 second?)  until
   the solicitation is answered by a mobile agent, and the mobile node
   can finally issue a registration request.


2.3. Agent Advertisement

   Every mobile node MUST correctly process ICMP Router Advertisements.
   Any foreign agent or home agent which is not identified by a link-
   layer protocol MUST send ICMP Router Advertisements.  An agent which
   is identified by a link-layer protocol SHOULD also implement Router
   Advertisements.  However, the advertisements need not be sent, except
   when the site policy requires registration with the agent, or as a
   response to a specific solicitation.

   The same procedures, defaults, and constants are used as described
   in "ICMP Router Discovery Messages" [5], except as specified herein;
   a foreign agent MUST NOT send Router Advertisements more often than
   once per second.

   The Router Advertisements are extended by examining the number of
   advertised addresses.  When the IP total length indicates that the
   ICMP message is longer than needed for the number of addresses
   present, the remainder is interpreted as extensions.  The extensions
   are described in section 4.

   The Mobility Extension (subsection 4.1) is required, and indicates
   that the router is an mobile agent.  Other extensions indicate
   optionally supported features (see, e.g., subsection 5.2).














Perkins, editor              Expires 21 April 1994              [Page 7]

Internet Draft            IP Mobility Support            21 October 1994


   The Code field of the ICMP Router Advertisement is interpreted as
   follows:

      0    If the Mobility Extension is present, the router supports
           mobility registration.  The router also handles common
           traffic -- that is, IP data packets not necessarily related
           to mobile nodes.

      16   A home or foreign agent which supports registration, but is
           not routing common traffic.

   A foreign agent includes the care-of address as a router address.

   Upon receipt of an agent advertisement, a mobile node compares the
   route address to that of the home agent(s) in its list.  If there
   is an exact match, the mobile node is at home.  Otherwise, the
   care-of address may be chosen from among advertising agents in the
   same fashion as the mobile node would choose a first hop router.  The
   highest preference router address which falls within a subnet that
   the mobile node has configured on its mobile interface(s) is used for
   the care-of address.

   It is very likely that no advertised routing prefix matches when the
   mobile node is not at home.  In this case, the highest preference
   non-matching router address is used for the care-of address.

   A home agent which does not provide foreign agent services will have
   preference values less than the highest foreign agent preference.

          DISCUSSION: What is this value?





















Perkins, editor              Expires 21 April 1994              [Page 8]

Internet Draft            IP Mobility Support            21 October 1994


3. Registration

   The registration function exchanges information between mobile
   nodes and home agents.  Registration creates a mobility binding,
   associating the mobile node's home address with a care-of address
   which can be used to reach the mobile node.

   When assigned a transient care-of address, a mobile node can act
   without a foreign agent, and register or de-register directly with a
   home agent.  This registration process involves the exchange of only
   2 messages:

    a) The mobile node sends a registration request to a home agent, to
       ask that home agent to provide the requested service.

    b) The home agent sends a registration reply to the mobile node to
       grant or deny service.

   An administrative domain MAY require registration through a foreign
   agent (see the description of the "F" bit, in subsection 4.1).

   When the care-of address is associated with a foreign agent, the
   foreign agent acts as a relay between the mobile node and home
   agent.  This extended registration process involves the exchange of 4
   messages:

    a) The mobile node sends a registration request to the prospective
       foreign agent to begin the registration process.

    b) The foreign agent relays the request to the home agent, asking
       that home agent to provide the requested service.

    c) The home agent sends a registration reply to the foreign agent to
       grant or deny service.

    d) The foreign agent sends a copy of the registration reply to the
       mobile node to inform it of the disposition of its request.

   The registration messages defined in this section(3.2, 3.3) use the
   User Datagram Protocol header [18].  The UDP checksum is required.
   Any mobility message with an incorrect or zero UDP checksum is
   silently discarded.









Perkins, editor              Expires 21 April 1994              [Page 9]

Internet Draft            IP Mobility Support            21 October 1994


3.1. Authentication

   Each mobile node, foreign agent, and home agent MUST support
   the maintenance of an internal table holding a list of security
   associations for mobile entities, indexed by their IP address.

   Mobile node to home agent registration messages are required to be
   authenticated with the Mobile-Home Authentication Extension (see
   subsection 4.4).  See section 9.1 for support requirements for
   authentication algorithms.

   Mobile-Foreign and Foreign-Home Authentications use the IP
   Authentication Header [1].

   Only one mobility security association at a time is in effect between
   any given pair of participating nodes.  Whenever a mobility security
   association exists between a pair of nodes, all registration messages
   between these nodes MUST be authenticated.


3.2. Registration Request

   The registration request message is sent by a mobile node to its
   home agent, so that the home agent can create a new mobility binding
   for the mobile node (with a new lifetime).  The registration may be
   relayed to the home agent by the foreign agent from which the mobile
   node is accepting service, or it may be sent directly in case the
   mobile node has received a temporary care-of address by some other
   means (e.g, DHCP [7]).

   IP fields:

      Source        An IP address belonging to the interface on which
                    this message is sent.

                    A mobile node MUST use the transient care-of address
                    when assigned; otherwise, the home address is used.

      Destination   The IP address of the agent, when known.

                    When the IP address is unknown (the agent was
                    discovered via a link-layer protocol), the "All
                    Mobile Agents" multicast address (224.0.0.11).  The
                    link-layer unicast address is used to deliver the
                    datagram to the correct agent.






Perkins, editor             Expires 21 April 1994              [Page 10]

Internet Draft            IP Mobility Support            21 October 1994


   UDP fields:

      Source Port        variable

      Destination Port   434

   The UDP Header is followed by the Mobile-IP fields shown below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |           Lifetime            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                           Home Agent                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Care-of Address                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                         Identification                        +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Extensions ...
   +-+-+-+-+-+-+-+-

      Type              1

      Code              Optional capabilities:

                        0   remove prior registrations
                        1   retain prior registrations

      Lifetime          The number of seconds remaining before the
                        registration is considered expired.  A value of
                        zero indicates a request for deregistration.  A
                        value of all ones indicates infinity.

      Home Agent        The IP address of a home agent.

      Care-of Address   The IP address for the decapsulation end of a
                        tunnel.

      Identification    A 64-bit sequence number, assigned by the mobile
                        node, used to assist in matching requests with
                        replies, and in protecting against replay
                        attacks (see section 9.6).

   The Home Address Extension (subsection 4.2) is required.  The
   Mobile-Home Authentication Extension (subsection 4.4) is required,



Perkins, editor             Expires 21 April 1994              [Page 11]

Internet Draft            IP Mobility Support            21 October 1994


   and immediately follows all non-authentication extensions, except
   those foreign agent specific extensions which may be added to the
   packet after the mobile node computes the authentication.


3.3. Registration Reply

   The registration reply message is returned by a home agent to a
   mobile node which has sent a registration request (subsection 3.2)
   message.  If the mobile node is accepting service from a foreign
   agent, that foreign agent will receive the reply from the home agent
   and subsequently relay it to the mobile node.  The reply message
   contains the necessary codes to inform the mobile node about the
   status of its request, along with the lifetime granted by the home
   agent, which MAY be smaller than the original request.  When the
   lifetime of the reply is greater than the original request, the
   excess time SHOULD be ignored.  When the lifetime of the reply is
   smaller than the original request, another registration SHOULD occur
   before the lifetime expires.

   IP fields:

       The source and destination IP addresses of the request message
       are swapped for the reply message.

   UDP fields:

       The source port and destination port of the request message are
       swapped for the reply message.

   Note that the source IP address and the source UDP port of the
   original registration request must be saved in order for the foreign
   agent to return the reply to the correct mobile node UDP port.

          DISCUSSION: I think this means that well-known port 435
                      will go unused.















Perkins, editor             Expires 21 April 1994              [Page 12]

Internet Draft            IP Mobility Support            21 October 1994


   The UDP Header is followed by the Mobile-IP fields shown below:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |           Lifetime            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                         Identification                        +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Extensions ...
   +-+-+-+-+-+-+-+-

      Type             3

      Code             One of the following codes:

                       0    service will be provided.

                       Service denied by the foreign agent:

                       16   reason unspecified.
                       17   administratively prohibited.
                       18   insufficient resources.
                       19   mobile node failed authentication.
                       20   home agent failed authentication.
                       21   requested lifetime too long.

                       Service denied by the home agent:

                       32   reason unspecified.
                       33   administratively prohibited.
                       34   insufficient resources.
                       35   mobile node failed authentication.
                       36   foreign agent failed authentication.

                       Up-to-date values of the Code field are specified
                       in the most recent "Assigned Numbers" [20].

      Lifetime         The seconds remaining before the registration is
                       considered expired.  A value of zero confirms a
                       request for de-registration.  A value of all ones
                       indicates infinity.

      Identification   The registration identification is copied from
                       the request message.




Perkins, editor             Expires 21 April 1994              [Page 13]

Internet Draft            IP Mobility Support            21 October 1994


4. Mobility Message Extensions

   Each message begins with a short fixed part, followed by one or more
   mobility message extensions in type-length-value format.  These
   extensions may apply to agent advertisement messages (subsection 2.3)
   and registration messages (section 3).

   The Home Address Extension (subsection 4.2) is required.  The
   Mobile-Home Authentication Extension (subsection 4.4) is required,
   and immediately follows all non-authentication extensions, except
   those foreign agent specific extensions which may be added to the
   packet when it is being relayed through a foreign agent.  When
   forwarded by a foreign agent, extensions which are specific to
   the foreign agent are removed.  All others are copied without
   modification.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |    Data ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-

      Extension

         Current values are assigned as follows:

         16   Mobility
         17   Home Address
         18   Key Identifier
         32   Mobile-Home Authentication
         64   Minimal Encapsulation
         65   GRE Encapsulation (see [10])

         Up-to-date values are specified in the most recent "Assigned
         Numbers" [20].

      Length

         Indicates the length (in bytes) of the data field.  The length
         does not include the Extension and Length bytes.

      Data

         This field is zero or more bytes in length and contains the
         value(s) for this extension.  The format and length of the data
         field is determined by the extension and length fields.





Perkins, editor             Expires 21 April 1994              [Page 14]

Internet Draft            IP Mobility Support            21 October 1994


   Extensions allow variable amounts of information to be carried within
   each datagram.  The end of the list of extensions is indicated by the
   total length of the IP datagram.

   When an extension is encountered which is not recognized, it is
   ignored.  The length field of the extension is used to skip the data
   field in searching for the next extension.


4.1. Mobility Extension

   The Mobility Extension is used to indicate that a Router
   Advertisement message is actually an agent advertisement being sent
   by a home agent or foreign agent (see subsection 2.3).  All agents
   which send agent advertisements are presumed to be foreign agents.
   When agents cannot accept new requests for service from mobile
   clients, they will set the Busy bit; if the Busy bit is turned off,
   the agent may attract new mobile clients.  An agent which wishes to
   serve only as a home agent, MUST set the Busy bit in addition to the
   "H" bit in the mobility extension.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        Sequence Number        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |R|B|H|F|reservd|
   +-+-+-+-+-+-+-+-+

      Extension         16

      Length            3

      Sequence Number   Contains the number of advertisement messages
                        sent since the node was initialized.

      F                 Foreign agent registration required bit.  When
                        this bit is set to 1, the mobile node SHOULD
                        register through the foreign agent, even
                        when the mobile node has acquired a transient
                        care-of address.

      B                 Busy bit.  The agent is not willing to
                        accept any more registrations, even though it
                        continues to send advertisements with a positive
                        preference.

      H                 Agent is offering service as a home agent.



Perkins, editor             Expires 21 April 1994              [Page 15]

Internet Draft            IP Mobility Support            21 October 1994


      reservd           Sent as zero; ignored on reception.

   The sequence number MUST count the current advertisement; that
   is, it begins with one (1) and wraps to zero (0).  When this
   value decreases, or the value one (1) follows any other value
   than zero (0), the mobile node MUST assume that any current
   registration has been lost.  This field cannot roll over in less
   than MIN_ADVERTISEMENT_INTERVAL*(2**16) seconds (more than 18 hours),
   and rollover is unambiguously indicated by the value zero (0) and
   followed by the value one (1).


4.2. Home Address Extension

   The home address extension is be found in registration requests
   (see subsection 3.2).  This extension requests that packets for
   entire subnets be tunneled and delivered to the mobile node, not just
   packets for the mobile node's particular IP address.  More than one
   home address extension MAY be present.  If any have nonzero prefix
   size, a prefix is inferred by retaining the most significant bits
   (specified by the prefix size) of the home address.  Then the home
   agent will intercept packets for any destinations that match that
   prefix and tunnel them to the mobile node.  After decapsulation, the
   foreign agent will then deliver the packets to that mobile node in
   its visitor list, which has been associated with the inferred prefix
   matching the tunneled packet.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |   reserved    |  Prefix Size  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Home Address                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Extension      17

      Length         6

      reserved       Sent as zero; ignored on reception.

      Prefix Size    The size of the left-justified bit-mask that is
                     applied to the home address to determine the IP
                     routing prefix.  Ranges from 0 to 30.  Set to zero
                     by mobile nodes which are not routers.

      Home Address   The IP address of the mobile node.




Perkins, editor             Expires 21 April 1994              [Page 16]

Internet Draft            IP Mobility Support            21 October 1994


4.3. Key Identifier

   The key identifier extension is be found in registration requests
   (see subsection 3.2).  This extension informs the home agent that
   authentication is performed using a cryptographic key or algorithm
   different than the home agent would use by default.  If a home
   agent receives a registration request which does not contain
   this extension, the home agent assumes that the mobile node used
   the default Message Authentication Code (see subsection 9.1) to
   authenticate the registration.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |         Key Identifier        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Extension      18

      Length         4

      reserved       Sent as zero; ignored on reception.

      Key Identifier

   The key identifier may be chosen from a list which is privately
   configured between the home agent and the mobile node.  In this case,
   the identifier is completely opaque; no information about which
   cryptographic algorithm to be used is obvious from the specific value
   of the key identifier.

   However, it is also possible for the home agent and mobile node
   to agree that the value of the key identifier corresponds to the
   identifier of the cryptographic algorithm used, according to a table
   to be established and kept by IANA, the Internet Assigned Numbers
   Authority.  So, if there have not been any specific values for key
   identifier configured between the home agent and the the mobile
   host, the home agent will understand the key identifier to select a
   particular cryptographic algorithm and mode.  See subsection 9.1 for
   a primitive list of algorithms and modes.


4.4. Mobile-Home Authentication Extension

   This extension is found in all registration requests and replies,
   and is intended to eliminate problems which are well known to result
   from the uncontrolled propagation of remote redirects in the Internet




Perkins, editor             Expires 21 April 1994              [Page 17]

Internet Draft            IP Mobility Support            21 October 1994


   (section 9).  See subsection 9.1 for information about support
   requirements for message authentication codes, etc.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        Authenticator ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Extension       32

      Length          The number of data bytes in the extension.

      Authenticator   (variable length) A hash value taken over a stream
                      of bytes including the shared secret, all prior
                      extensions in their entirety, and the type and
                      length of this extension, but not including the
                      Authenticator field itself.


4.5. Minimal Encapsulation Extension

   The Minimal Encapsulation Extension is found in agent advertisements
   (subsection 2.3) and registration requests (subsection 5.2).

    0                   1
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Extension   64

      Length      0

















Perkins, editor             Expires 21 April 1994              [Page 18]

Internet Draft            IP Mobility Support            21 October 1994


5. Forwarding Datagrams to the Mobile Node

5.1. IP in IP Encapsulation

   Support for IP in IP encapsulated datagrams is required.

   An outer, full-sized IP fragmentation header is inserted before the
   datagram's IP header:

                                          +---------------------------+
                                          |      Outer IP Header      |
      +---------------------------+       +---------------------------+
      |         IP Header         |       |         IP Header         |
      +---------------------------+ ====> +---------------------------+
      |                           |       |                           |
      |         IP Payload        |       |         IP Payload        |
      |                           |       |                           |
      +---------------------------+       +---------------------------+

   The format of the IP header is described in [19].  The outer IP
   header source and destination addresses identify the "endpoints" of
   the tunnel.  The inner IP header source and destination addresses
   identify the sender and recipient of the datagram.

   The protocol field in the outer IP header is set to protocol number
   4 for the encapsulation protocol.  The destination field in the
   outer IP header set to the care-of address of the mobile node.  The
   source field in the outer IP header is set to the IP address of the
   encapsulating agent.

   When the datagram is encapsulated, the Time To Live (TTL) field in
   the outer IP header is set to be the same as the original datagram.
   When decapsulating, the outer IP TTL minus one is inserted into the
   inner IP TTL. Thus, IP hops are counted, but the actual routers
   interior to the tunnel are not identified.


5.2. Minimal Encapsulation

   A minimal forwarding header is defined for datagrams which are not
   fragmented prior to encapsulating.  When a datagram is already
   fragmented prior to encapsulating, IP in IP is used.

   Use of this encapsulating method is optional.







Perkins, editor             Expires 21 April 1994              [Page 19]

Internet Draft            IP Mobility Support            21 October 1994


   The minimal header is inserted between the datagram's IP header and
   the rest of the datagram:

      +---------------------------+       +---------------------------+
      |         IP Header         |       |     Modified IP Header    |
      +---------------------------+ ====> +---------------------------+
      |                           |       |     Forwarding Header     |
      |         IP Payload        |       +---------------------------+
      |                           |       |                           |
      +---------------------------+       |         IP Payload        |
                                          |                           |
                                          +---------------------------+

   A foreign agent which is capable of decapsulating the minimal header
   will include the Minimal Encapsulation Extension (subsection 4.5) in
   its Router Advertisements.

   A mobile node indicates the capability of decapsulating the minimal
   header at the care-of address by the inclusion of the Minimal
   Encapsulation Extension in its registration request.

   The Minimal Encapsulation Extension is not included in the
   registration reply.  The use of the minimal header is entirely at the
   discretion of the home agent.

   The format of the minimal forwarding header is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Protocol    |S|  reserved   |        Header Checksum        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         Home Address                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Correspondent Source Address                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Protocol

         Copied from the protocol field in the original IP header.











Perkins, editor             Expires 21 April 1994              [Page 20]

Internet Draft            IP Mobility Support            21 October 1994


      S

         Source field present bit, which indicates that the
         Correspondent Source Address field is present.

          0 not present.
          1 present.

      reserved

         Sent as zero; ignored on reception.

      Header Checksum

         The 16-bit one's complement of the one's complement sum of the
         encapsulation header.  For computing the checksum, the checksum
         field is set to 0.

      Home Address

         Copied from the destination field in the original IP header.

      Correspondent Source Address

         Copied from the source field in the original IP header.
         Present only if the S-bit is set.

   The protocol field in the IP header is replaced by protocol number 55
   for the minimal encapsulation protocol.  The destination field in the
   IP header is replaced by the care-of address of the mobile node.  If
   the encapsulating agent is not the original source of the datagram,
   the source field in the IP header is replaced by the IP address of
   the encapsulating agent.  The Don't Fragment bit is set in the IP
   header.

   When decapsulating a datagram, the fields in the forwarding header
   are restored to the IP header, and the forwarding header is removed
   from the datagram.













Perkins, editor             Expires 21 April 1994              [Page 21]

Internet Draft            IP Mobility Support            21 October 1994


6. Mobile Node Considerations

   A mobile node listens for agent advertisements at all times that it
   has a link connection.  In this manner, it can learn that its foreign
   agent has changed, or that it has arrived home.

   Whenever a mobile node detects a change in its point of attachment,
   it MUST initiate the registration process.  If it is away from home,
   it MUST create a mobility binding by registering with its home agent
   (see subsections 3.2, 2.3).  If the mobile node is returning to its
   home network, it MUST deregister with its home agent.  A mobile node
   will operate without the support of mobility functions when it is at
   home.

   See appendix B for some considerations regarding the interaction of
   this mobility specification with features commonly found in link
   layer implementations for media which may be used with mobile nodes.

   Receipt of an ICMP Redirect from a registered agent MUST NOT affect
   the choice of agent for re-registrations.  ICMP Redirect only affects
   the choice of preferred router for forwarding decisions.

   If desired, the Mobile Node can create a tunnel to its Home Agent.
   The definition of such a mechanism is outside the scope of this
   document.

    DISCUSSION: Why are we keeping this here?
                Any node can do encapsulation!
                Does anyone remember the motivation for it?


6.1. Configuration and Registration Tables

   Each mobile node will need:

    - home address
    - prefix size
    - one or more home agents
    - mobility security association for each home agent

   For each pending registration:

    - MAC address of agent
    - care-of address
    - registration identification
    - lifetime





Perkins, editor             Expires 21 April 1994              [Page 22]

Internet Draft            IP Mobility Support            21 October 1994


6.2. Registration When Away From Home

   In the absence of link-layer indications of changes in point of
   attachment, agent advertisements from new agents do not necessarily
   affect a current registration.  In the absence of link-layer
   indications, a mobile node must not attempt to register more often
   than once per second.  A mobile node may register with a different
   agent when:

    - transport-layer protocols indicate excessive retransmissions.
    - its current registration lifetime has expired.

   The mobile node MUST NOT register with a new agent simply because a
   higher preference agent has appeared, or the preference values change
   for the agent with which it is currently registered.

   If a mobile node detects a reduction in the Sequence Number of
   an agent advertisement from a foreign agent through which it has
   registered, the mobile node MUST register again.  Such a reduction
   does not include the wrap of the Sequence Number to zero.

   A mobile node SHOULD NOT request a lifetime for its registration that
   exceeds the lifetime learned in an agent advertisement.  When the
   method by which the care-of address is learned does not include a
   lifetime, the default Router Advertisement lifetime (1800 seconds)
   may be used.  The lifetime MAY be modified by the home agent in its
   reply.

   A mobile node SHOULD register again before the lifetime of its
   registration expires.  The mobile node MAY register again at any
   time.

   A mobile node MAY ask a home agent to terminate forwarding service
   to a particular care-of address, by sending a registration with a
   lifetime of zero.  See also subsection 8.2.


6.3. Registration without a foreign agent

   In cases where a mobile node away from home is able to dynamically
   acquire a transient IP address (e.g, DHCP [7]), the mobile node
   can serve without a foreign agent, using the transient address as
   the care-of address.  Then all communication between the mobile
   node and its home agent can proceed without the intervention of
   foreign agents.  This eliminates the need to deploy foreign agents as
   separate entities.





Perkins, editor             Expires 21 April 1994              [Page 23]

Internet Draft            IP Mobility Support            21 October 1994


   This feature MUST NOT be used unless the mobile node has mechanisms
   to detect changes in its link-layer connectivity, and can initiate
   acquisition of a new transient address each time such a change
   occurs.

   The lifetime of such a registration is chosen by the mobile node.
   The lifetime MAY be modified by the home agent in its reply.

   However, on those links where the mobile node detects an agent
   advertisement that has the "F" bit set in the Mobility Extension
   (see subsection 2.3), the mobile node SHOULD register through an
   appropriate foreign agent, even when it might otherwise be able to
   register directly with a home agent.


6.4. De-registration When At Home

   At times, a mobile node might become attached to its home link, and
   will no longer need any forwarding service from its home agent.  A
   deregistration procedure MUST be used between the mobile node and its
   home agent.

   The deregistration process involves the exchange of only two
   messages:

    a) The mobile node sends a registration request directly to its home
       agent, with the lifetime set to zero, and the Code field set to
       0, to indicate that the home agent remove all related entries.

    b) The home agent sends a registration reply to the mobile node to
       grant or deny service.  In this special case, the care-of address
       is set to the home address.

   The mobile node is not required to register with its home agent.
   It MAY deregister each foreign agent, or it MAY allow its mobility
   bindings to simply expire.

        DISCUSSION: This appears to contradict the combination
        of the previous MUST, and the specification of the
        deregistration procedure.

   It is not necessary to register again with a home agent when a
   change of Sequence Number occurs, or the Advertisement lifetime
   expires, since the mobile node is not seeking encapsulating service.
   procedure MUST be used between the mobile node and its home agent.






Perkins, editor             Expires 21 April 1994              [Page 24]

Internet Draft            IP Mobility Support            21 October 1994


6.5. Registration Replies

   In order for a mobile node to accept a registration reply, the
   reply must have the same registration identification of its most
   recent registration request to the sender; otherwise, the message is
   silently discarded.

   When a reply is received which has a code indicating information from
   the foreign agent, the Mobile-Home Authenticator will be missing or
   invalid.  However, if no other reply has as yet been received, the
   reason for denial SHOULD be accepted, and result in an appropriate
   action.  If a later authenticated reply is received, that reply
   supersedes the unauthenticated reply.

   When a reply is received which has a code indicating that
   authentication failed with the home agent, the reason for denial
   SHOULD result in an appropriate action.

   DISCUSSION: Is this a reference to the need for resynchronization?

   Otherwise, when a reply is received with an invalid Authenticator,
   the message is silently discarded.

   The mobile node is not required to issue any message in response to a
   registration reply.


6.6. Registration Retransmission

   When no reply has been received within a reasonable time, the
   registration request is retransmitted.  A new registration
   identification is chosen for each retransmission.

   The minimum retransmission time SHOULD be related to the speed of
   the link.  The minimum value SHOULD be large enough to account for
   the size of the packets, twice the round trip time for transmission
   at the link speed, and at least an additional 100 milliseconds to
   allow for processing the packets before responding.  Some circuits
   add another 200 milliseconds of satellite delay.

   The initial time MUST NOT be less than 1 second.  At 9,600 bps or
   less, the recommended initial time is 3 seconds.  At 1,200 bps or
   less, the recommended initial time is 5 seconds.

   Each successive value less than the maximum value SHOULD be at least
   twice the previous value.





Perkins, editor             Expires 21 April 1994              [Page 25]

Internet Draft            IP Mobility Support            21 October 1994


   The maximum retransmission time SHOULD be no greater than the
   lifetime of the registration request.


6.7. Simultaneous Registrations

   Multiple simultaneous registrations are useful in several situations,
   for example when a mobile node is on a border between multiple
   cellular systems.

   IP explicitly allows duplication of datagrams.  When the home agent
   allows simultaneous registrations, it will encapsulate a separate
   copy of each arriving datagram to each care-of address, and the
   mobile node will receive multiple copies of its datagrams.

   In order to request this optional capability, the mobile node sends
   the registration request with the Code set to 1.  The return code
   in the registration reply is the same.  No error occurs if the home
   agent is unable to fulfill the request.  When the need for multiple
   registrations has passed, the mobile node SHOULD register again with
   the Code set to 0, to remove the other registrations.


6.8. Mobile Routers

   A mobile node can be a router, which is responsible for the mobility
   of an entire network moving together, such as on an airplane, a ship,
   a train, an automobile, a bicycle, or a kayak.

   Provision for a routing prefix in registration messages is needed
   when a mobile router registers through a foreign agent.  This
   allows a foreign agent to recognize all addresses attached to the
   mobile node when they are decapsulated at the care-of address (see
   subsection 4.2).

   When a transient IP address has been assigned, the mobile node can
   register directly with the home agent, as described previously.  Such
   a mobile node MAY advertise to other routers in the foreign routing
   domain.

   The mobile node MAY register multiple times with different home
   addresses and routing prefixes.  This permits multiple prefixes to be
   routed through the mobile node.

   When the mobile node returns home, and deregisters with the home
   agent, it participates directly in routing with other routers in its
   home routing domain.




Perkins, editor             Expires 21 April 1994              [Page 26]

Internet Draft            IP Mobility Support            21 October 1994


7. Foreign Agent Considerations

   The role of the foreign agent is passive and minimal, relaying
   registration requests between the home agent and the mobile node, and
   decapsulating datagrams for delivery to the mobile node.

   When no mobility security association exists, this also reduces the
   risks resulting from absence of authentication from foreign agent
   messages.

          DISCUSSION: Does anyone know why this is here?

   The foreign agent MUST NOT originate a request or reply that has not
   been prompted by the mobile node.  No request or reply is generated
   to indicate that the service lifetime has expired.

   A foreign agent MUST NOT originate a message which revokes the
   registration of a different foreign agent.  A foreign agent SHOULD
   forward such revocations without modification when such revocation
   messages originated from an appropriate mobile node.

   The foreign agent SHOULD NOT advertise the presence of the mobile
   node which is a router to other routers in its routing domain.

   The preference is used to regulate the number of mobile nodes which
   register with the foreign agent.  When the foreign agent would
   otherwise need to reject new registrations because of insufficient
   resources, the foreign agent SHOULD reduce its preference values
   until resources become available.






















Perkins, editor             Expires 21 April 1994              [Page 27]

Internet Draft            IP Mobility Support            21 October 1994


7.1. Configuration and Registration Tables

   Each foreign agent will need:

    - care-of address

   For each pending or current registration, the foreign agent will need
   a visitor list entry containing:

    - Media address of mobile node
    - home address
    - prefix size
    - home agent
    - registration identification
    - lifetime

   A foreign agent that has implemented and is using authentication
   will also need to have the mobility security association information
   for each pending or current authenticated registration.  Even
   if a foreign agent implements authentication, it might not use
   authentication with each registration, because of the key management
   difficulties.


7.2. Receiving Registration Requests

   Upon receipt of a registration request, if the foreign agent is
   unable to satisfy the request for some reason, then the foreign agent
   sends a registration reply to the mobile node with an appropriate
   code, and does not forward the request to the home agent.  Otherwise,
   the foreign agent forwards the request to the home agent.

   The foreign agent must maintain a list of pending requests, which
   includes the IP source address and UDP source port, in order that a
   correctly addressed reply can be returned to the mobile node.


7.3. Receiving Registration Replies

   The fields of the registration reply MUST be examined for validity.
   A registration reply which does not relate to a pending Registration
   Request, or to a currently registered mobile node, is silently
   discarded.

   If the registration reply granted permission to provide service to
   the mobile node, then the foreign agent updates its visitor list
   accordingly.




Perkins, editor             Expires 21 April 1994              [Page 28]

Internet Draft            IP Mobility Support            21 October 1994


7.4. Decapsulation

   Every foreign agent MUST examine all arriving encapsulated traffic
   and compare the destination address to those entries in its visitor
   list, considering both the home address and routing prefix for the
   entries (see subsection 4.2), in order to forward to the correct
   mobile node.

   When the destination does not match any node currently in the visitor
   list, the datagram SHOULD be silently discarded.  The datagram MUST
   NOT be further forwarded without modifications to the original IP
   header, because otherwise a routing loop is likely to result.  ICMP
   Destination Unreachable MUST NOT be sent when a foreign agent is
   unable to forward a datagram.


7.5. Mobility

   The foreign agent can be mobile, if the link identified by the
   care-of address is mobile.  The foreign agent could be either a node
   on a mobile network, or another mobile node itself.






























Perkins, editor             Expires 21 April 1994              [Page 29]

Internet Draft            IP Mobility Support            21 October 1994


8. Home Agent Considerations

   It is the intent that the home agent have primary responsibility for
   processing and coordinating mobility services.

   The home agent for a given mobile node SHOULD be located on the link
   identified by the home address, if the home network is not merely a
   virtual network.

   The home agent SHOULD advertise the presence of the mobile node which
   is a router to other routers in its routing domain.


8.1. Configuration and Registration Tables

   Each home agent will need:

    - an IP address
    - prefix size for the home network, if any

          DISCUSSION: If the home agent controls a virtual home network,
                      the home agent does NOT need an IP address on the
                      virtual home network.

   For each authorized mobile node, the home agent will need:

    - home address
    - mobility security association
    - prefix size(s) for the mobile network(s), if any

   For each registered mobile node, the home agent will need a
   forwarding list entry containing:

    - care-of address
    - registration identification
    - lifetime


8.2. Receiving Registration Requests

   Upon receipt of a registration request (subsection 3.2), the
   home agent grants or denies the service requested by sending a
   registration reply (subsection 3.2) to the sender of the request,
   with the appropriate code set.  If service permission is granted, the
   home agent will update its forwarding list with the care-of address
   of the tunnel.





Perkins, editor             Expires 21 April 1994              [Page 30]

Internet Draft            IP Mobility Support            21 October 1994


   The request is validated by checking that the registration
   identification is not the same as a preceding request, and the
   Mobile-Home Authentication Extension (subsection 4.4) is correct.
   Other Authentication Extensions are also validated when present.
   When a registration request is invalid, a registration reply is
   sent with the appropriate error code.  This reply will be used by a
   foreign agent to clear its pending request list, if a foreign agent
   was involved in relaying the registration request.

   The home agent MAY shorten the lifetime of the request.

   A mobile node requests termination of service by indicating a
   lifetime of zero.  If the Code field set to 1, the home agent removes
   the mobility binding for that care-of address from its forwarding
   list.  Otherwise, if the Code field is set to 0, the home agent
   removes the mobility bindings for all foreign agents associated
   with that mobile node from its forwarding list.  On termination, no
   special reply is sent to additional associated foreign agents.  The
   entries in their visitor lists are allowed to expire naturally.


8.3. Simultaneous Registrations

   When a home agent supports the optional capability of multiple
   simultaneous registrations, any datagrams forwarded are simply
   duplicated, and a copy is sent to each care-of address.

   The return code in the registration reply (subsection 3.3) is the
   same.  No error occurs if the home agent is unable to fulfill the
   request, and earlier entries in the forwarding list are removed.

        DISCUSSION: Does anyone know why no status
                    indication can be returned?


8.4. Registration Expiration

   If the lifetime for a given mobile node expires before the home agent
   has received a another registration request, then the associated
   mobility binding is erased from the forwarding list.

   No special registration reply is sent to the foreign agents.  The
   entries in the visitor lists will expire naturally, and probably at
   the same time.







Perkins, editor             Expires 21 April 1994              [Page 31]

Internet Draft            IP Mobility Support            21 October 1994


8.5. Encapsulation

   Every home agent MUST examine all arriving traffic for both the home
   address and routing prefix in order to forward to the correct mobile
   node.

   When previously encapsulated datagrams arrive that are associated
   with the routing prefix of the mobile node, the home agent simply
   alters the destination to the care-of address.  This avoids recursive
   encapsulation.  Other previously encapsulated datagrams, which are
   not associated with the routing prefix, are recursively encapsulated.


8.6. Mobility

   The home agent can be mobile, if the link identified by the home
   address it serves is mobile.  The home agent could be either a node
   on a mobile network, or another mobile node itself.

   A datagram would be encapsulated on its way to the mobile network,
   decapsulated for delivery to the mobile node, intercepted by the home
   agent, and re-encapsulated to the mobile node.





























Perkins, editor             Expires 21 April 1994              [Page 32]

Internet Draft            IP Mobility Support            21 October 1994


9. Security Considerations

   The mobile computing environment is potentially very different from
   the ordinary computing environment.  In many cases, mobile computers
   will be connected to the network via wireless links.  Such links
   are particularly vulnerable to passive eavesdropping, active replay
   attacks, and other active attacks.


9.1. Message Authentication Codes

   Home agents and mobile nodes MUST be able to perform keyed MD5 [21],
   with a key size of 128 bits, for authentication, with the key
   prefixed and suffixed to the data to be hashed.  In addition, the
   foreign agent SHOULD support authentication using keyed MD5 and
   key sizes of 128 bits or greater, with manual key distribution.
   Additional authentication algorithms, algorithm modes, key
   distribution methods, and key sizes MAY also be supported.

   Here is a primitive list of algorithms and modes which may be used by
   home agents and mobile nodes.

     0       128+     Keyed-MD5 with both suffix and prefix
     1       128+     Keyed-MD5 with suffix

     3       160      Keyed-SHA with both suffix and prefix
     4       160      Keyed-SHA with suffix

     6       160      Keyed-SHA1 with both suffix and prefix
     7       160      Keyed-SHA1 with suffix

     16      56       DES         (Block cipher in MAC mode)
     17      168      Triple-DES  (Block cipher in MAC mode)

     24      ?        RC2         Variable Key Size symmetric
                                  block cipher in MAC mode

     DISCUSSION: If anyone knows of a better list described in
                 an existing RFC, please let me know


9.2. Tunneling to Care-of Addresses

   The registration protocol described in this document will result
   in a mobile node's traffic being tunneled to its care-of address.
   This tunneling feature could be a significant vulnerability if the
   registration were not authentic.  Such remote redirection, for
   instance as performed by the mobile registration protocol, is widely



Perkins, editor             Expires 21 April 1994              [Page 33]

Internet Draft            IP Mobility Support            21 October 1994


   understood to be a security problem in the current Internet [2].
   Moreover, the Address Resolution Protocol (ARP) is not authenticated,
   and can potentially be used to steal another host's traffic.  The use
   of "Gratuitous ARP"(see Appendix A) brings with it all of the risks
   associated with the use of ARP.


9.3. Key management

   This specification requires a strong authentication mechanism (keyed
   MD5) which precludes many potential attacks based on the Mobile
   IP registration protocol.  However, because key distribution is
   difficult in the absence of a network key management protocol,
   not all messages with the foreign agent are authenticated.
   Vulnerabilities remain in the registration protocol whenever a
   registration message is not authenticated.  For example, in a
   commercial environment it might be important to authenticate all
   messages between the foreign agent and the home agent, so that
   billing is possible, and service providers don't provide service to
   users that are not legitimate customers of that service provider.


9.4. Picking good keys

   The strength of any authentication mechanism is dependent on
   several factors, including the innate strength of the authentication
   algorithm, the secrecy of the key used, the strength of the key used,
   and the quality of the particular implementation.  This specification
   requires implementation of keyed MD5 for authentication, but does
   not preclude the use of other authentication algorithms and modes.
   For keyed MD5 authentication to be useful, the 128-bit key must
   be both secret (that is, known only to authorized parties) and
   pseudo-random.  Eastlake, et.al. [8] provides more information on
   generating pseudo-random numbers.


9.5. Privacy

   Users who have sensitive data that they do not wish others to see
   should use mechanisms outside the scope of this document (such as
   encryption) to provide appropriate protection.  Users concerned about
   traffic analysis should consider appropriate use of link encryption.


9.6. Replay Protection for Registration Requests

   A Network Time Protocol [15] formatted value is preferred.  The
   low-order 32 bits of the NTP format represent fractional seconds,



Perkins, editor             Expires 21 April 1994              [Page 34]

Internet Draft            IP Mobility Support            21 October 1994


   and those bits which are not available from a time source SHOULD be
   generated from a good source of randomness.

   A battery-backed clock is the usual source of this value.  In more
   robust implementations, Global Positioning System or authenticated
   NTP values MAY be used.  The elapsed time since system startup or
   another such monotonically increasing counter MAY be used, but is
   considered less secure, as it could repeat each time the machine
   is restarted, or when a poor source of randomness is used for the
   low-order bits.  See Eastlake, et.al. [8] for a discussion of sources
   of randomness.

   The value MUST NOT be the same as an immediately preceding request,
   and SHOULD NOT repeat during the lifetime of the mobility security
   association between the mobile node and the home agent.

   It is possible to use an entirely random "nonce" in this field, or to
   generate nonces from previous registration exchanges.

     DISCUSSION: The use of nonces for replay
     protection may depend partially on the resolution
     of a patent issue.  Moreover, there is a problem
     with interoperability; a mobile node and its home
     agent must agree on the use of nonces, because if
     a home agent expects only a nonce, it is unlikely
     that the mobile node's time value will be accepted.


10. Acknowledgements

   Special thanks to Steve Deering (Xerox PARC), along with Dan Duchamp
   and John Ioannidis (Columbia), for forming the working group,
   chairing it, and putting so much effort into its early development.

   Thanks also to Greg Minshall for his contributions to the group while
   performing the duties of chairperson.















Perkins, editor             Expires 21 April 1994              [Page 35]

Internet Draft            IP Mobility Support            21 October 1994


   Thanks to the active members of the Working Group, particularly those
   who contributed text, including (in alphabetical order)

    - Ran Atkinson (Naval Research Lab),
    - Dave Johnson (Carnegie Mellon University),
    - Andrew Myles (Macquarie University),
    - John Penners (US West),
    - Al Quirt (Bell Northern Research),
    - Yakov Rekhter (IBM), and
    - Fumio Teraoka (Sony).

   Thanks to Charlie Kunzinger, the editor who produced the first drafts
   for the Working Group, and to Bill Simpson, who has produced most of
   the text of this draft, reflecting the discussions of the Working
   Group.

   Thanks to Greg Minshall (Novell) and Phil Karn (Qualcomm) for their
   generous support in hosting interim Working Group meetings.


A. Gratuitous and Proxy ARP

   Many people will use their computers for extended periods of time
   on a single link, whether or not it is at their home network.  When
   doing so, they will expect the same level of service from their
   infrastructure as they receive today on the home network.

   A separate "virtual" IP address block is not required for mobile
   nodes.  This would require a small network to have an extra router
   between the mobile and non-mobile nodes, which is an unacceptable
   expense.

   This section details the special care to be taken when using ARP [17]
   with nodes on the same link as a mobile node.

   A problem can arise if a mobile node which has previously answered an
   ARP Request moves away from the link, leaving behind a stale entry in
   another node's ARP cache.  For example, if a router which forwards
   datagrams into the home network has a stale ARP cache entry for the
   mobile node, any datagrams arriving through that router for the
   mobile node will be lost.  Thus, it is important that ARP caches of
   nodes populating the link be updated as soon as possible.

   A gratuitous ARP is an ARP Reply that is broadcast to all nodes on
   a link, which is not in response to any ARP Request.  When an ARP
   Reply is broadcast, all hosts are required to update their local
   ARP caches, whether or not the ARP Reply was in response to an ARP
   Request they had issued.



Perkins, editor             Expires 21 April 1994              [Page 36]

Internet Draft            IP Mobility Support            21 October 1994


   When there is a physical link which corresponds to the home network,
   a gratuitous proxy ARP is issued by the home agent on behalf of a
   mobile node whenever the home agent receives a valid registration.
   The gratuitous proxy ARP will indicate that all remaining nodes
   should associate the home address of the mobile node with the
   link-layer address of the home agent which is now serving the mobile
   node.

   In the gratuitous ARP, the source IP address is the home address, the
   MAC address is the source link-layer address for the interface used,
   the target IP address would be the all-systems multicast address, and
   the target link-layer address would be the general broadcast address.

   While the mobile node is away from its home network, the home agent
   performs proxy ARP Replies for the mobile node.  When a mobile node
   returns to its home network, it SHOULD issue a gratuitous ARP on its
   own behalf, immediately before sending the de- registration request
   to the home agent.

   Although the gratuitous ARP can be lost, this is not different from
   the usual ARP Reply problems, which are outside the scope of this
   document.  A home agent may repeat the gratuitous ARP a small number
   of times to allow for the possibility of the first packet getting
   lost.


B. Link-Layer considerations

   The mobile node primarily uses link-layer mechanisms to decide that
   its point of attachment has changed.  Such indications include
   the Down/Testing/Up interface status [13], and changes in cell or
   administration.  The mechanisms will be specific to the particular
   link-layer technology, and are outside the scope of this document.


B.1. Point-to-Point Link-Layers

   The Point-to-Point-Protocol (PPP) [22] and its Internet Protocol
   Control Protocol (IPCP) [14], negotiates the use of IP addresses.

   The mobile node SHOULD first attempt to specify its home address.
   This allows an unrouted link to function correctly.

   When the home address is not accepted by the peer, but a transient
   IP address is dynamically assigned, that address MAY be used as the
   care-of address for registration.





Perkins, editor             Expires 21 April 1994              [Page 37]

Internet Draft            IP Mobility Support            21 October 1994


   When the peer specifies its own IP address, that address MUST NOT
   be assumed to be the care-of address of a foreign agent or the IP
   address of a home agent.

          DISCUSSION: Can anyone explain better what's going on here?

   When Router Advertisements are received which contain the Mobility
   Extension, registration with the agent SHOULD take place as usual.
   If the link is bandwidth limited, this method is preferred over use
   of the transient care-of address, The encapsulation will be removed
   by the peer, allowing header compression techniques to function
   correctly [11].


B.2. Multi-Point Link-Layers

   Another link establishment protocol, IEEE 802.11 [6], might yield the
   link address of an agent.  This link-layer address SHOULD be used to
   attempt registration.

   The receipt of a Router Advertisement supersedes the link-layer
   address, and a new registration MUST occur.


C. TCP Considerations

C.1. TCP Timers

   Most hosts and routers which implement TCP/IP do not permit easy
   configuration of the TCP timer values.  When high-delay (e.g.
   SATCOM) or low-bandwidth (e.g.  High-Frequency Radio) links are
   in use, the default TCP timer values in many systems will cause
   retransmissions or timeouts when the link and network is actually
   operating properly, though with greater than usual delays because
   of the medium in use.  This can cause an inability to create or
   maintain connections over such links, and can also cause unneeded
   retransmissions which consume already scarce bandwidth.  Vendors are
   encouraged to make TCP timers more configurable.  Vendors of systems
   designed for the mobile computing markets should pick default timer
   values more suited to low-bandwidth, high-delay links.  Users of
   mobile nodes should be sensitive to the possibility of timer-related
   difficulties.


C.2. TCP Congestion Management

   Mobility nodes are likely to use media which have low bandwidth and
   are more likely to introduce errors, effectively causing more packets



Perkins, editor             Expires 21 April 1994              [Page 38]

Internet Draft            IP Mobility Support            21 October 1994


   to be dropped.  This introduces a conflict with the mechanisms for
   congestion management found in modern versions of TCP. Now, when
   a packet is dropped, the correspondent's TCP implementation is
   likely to react as if there were a source of network congestion, and
   initiate the slow-start mechanisms [4] designed for controlling that
   problem.  However, those mechanisms are inappropriate for overcoming
   errors introduced by the links themselves, and have the effect of
   magnifying the discontinuity introduced by the dropped packet.  This
   problem has been analyzed by Caceres, et.  al.  ( [3]); there is
   no easy solution available, and certainly no solution likely to
   be installed soon on all correspondents.  While this problem has
   nothing to do with any of the specifications in this document, it
   does illustrate that providing performance transparency to mobile
   nodes involves understanding mechanisms outside the network layer.
   It also indicates the need to avoid designs which systematically drop
   packets; such designs might otherwise be considered favorably when
   making engineering tradeoffs.


D. Tunnel Management

   It is possible that one of the routers along the tunnel interior
   might encounter an error while processing the datagram, causing it to
   return an IP ICMP error message to the source end of the tunnel.  The
   three types of ICMP errors that can occur in this circumstance are:

    - Datagram Too Big
    - Time Exceeded
    - Destination Unreachable

   Unfortunately, ICMP only requires IP routers to return 8 bytes (64
   bits) of the datagram beyond the IP header.  This is not enough to
   include the encapsulated header, so it is not generally possible
   for the home agent to immediately reflect the ICMP message from the
   interior of a tunnel back to the source host.

   However, by carefully maintaining "soft state" about its tunnels,
   the encapsulating router can return accurate ICMP messages in most
   cases.  The router SHOULD maintain at least the following soft state
   information about each tunnel:

    - MTU of the tunnel
    - TTL (path length) of the tunnel
    - Reachability of the end of the tunnel

   The router uses the ICMP messages it receives from the interior of a
   tunnel to update the soft state information for that tunnel.  When
   subsequent datagrams arrive that would transit the tunnel, the router



Perkins, editor             Expires 21 April 1994              [Page 39]

Internet Draft            IP Mobility Support            21 October 1994


   checks the soft state for the tunnel.  If the datagram would violate
   the state of the tunnel (such as, the TTL is less than the tunnel
   TTL) the router sends an ICMP error message back to the source, but
   also forwards the datagram into the tunnel.

   Using this technique, the ICMP error messages sent by encapsulating
   routers will not always match up one-to-one with errors encountered
   within the tunnel, but they will accurately reflect the state of the
   network.

   The Don't Fragment bit is always set within the tunnel.  This enables
   the proper MTU of the tunnel to be determined.  Fragmentation which
   occurs because of the size of the encapsulation header is done before
   encapsulation, preventing more than one layer of fragmentation in a
   single datagram.

          DISCUSSION: Would anyone like to provide more explanation?
                      Or, should we just delete most of it
                      and be satisfied with a reference in the
                      section about Home Agent Considerations?

   Tunnel soft state was originally developed for the IP address
   encapsulation (IPAE) specification [9].


References

    [1] R. Atkinson.  SIPP Authentication Header.  Internet Draft --
        work in progress, April 1994.

    [2] S.M. Bellovin.  Security Problems in the TCP/IP Protocol Suite.
        ACM Computer Communications Review, 19(2), March 1989.

    [3] Ramon Caceres and Liviu Iftode.  The Effects of Mobility on
        Reliable Transport Protocols.  In Proceedings of the 14th
        International Conference on Distributed Computing Systems, June
        1994.

    [4] Douglas E. Comer.  Internetworking with TCP/IP, volume 1.
        Prentice Hall, 1991.

    [5] S. Deering.  Router Discovery.  RFC 1256, September 1991.

    [6] Wim Diepstraten, Greg Ennis, and Phil Belanger.  DFWMAC -
        Distributed Foundation Wireless Medium Access Control.  IEEE
        Document P802.11-93/190, Nov 1993.





Perkins, editor             Expires 21 April 1994              [Page 40]

Internet Draft            IP Mobility Support            21 October 1994


    [7] R. Droms.  Dynamic Host Configuration Protocol.  RFC 1541,
        October 1993.

    [8] D.E. Eastlake, S.D. Crocker, and J.I. Schiller.  Randomness
        Requirements for Security.  Internet Draft -- work in progress,
        October 1994.

    [9] R. Gilligan, E. Nordmark, and B. Hinden.  IPAE: The SIPP
        Interoperability and Transition Mechanism.  Internet Draft --
        work in progress, March 1994.

   [10] S. Hanks, T. Li, D. Farinacci, and P. Traina.  Generic routing
        encapsulation (gre).  draft-hanks-gre-00.txt -- work in
        progress, October 1994.

   [11] V. Jacobson.  Compressing TCP/IP Headers for Low-Speed Serial
        Links.  RFC 1144, February 1990.

   [12] J. Kohl and C. Newman.  The Kerberos Network Authentication
        Service (V5).  RFC 1510, September 1993.

   [13] K. McCloghrie and F. Kastenholz.  Evolution of the Interfaces
        Group MIP-II.  RFC 1573, January 1994.

   [14] G. McGregor.  The PPP Internet Procotol Control Protocol (IPCP).
        RFC 1332, May 1992.

   [15] D. Mills.  Network Time Protocol (Version 3).  RFC 1305, March
        1992.

   [16] National Bureau of Standards.  Data Encryption Standard.
        Federal Information Processing Standards, 1977.

   [17] D. Plummer.  An Ethernet Address Resolution Protocol.  RFC 826,
        November 1982.

   [18] J. Postel.  User Datagram Protocol.  RFC 768, August 1980.

   [19] J. Postel.  Internet Protocol.  RFC 791, September 1981.

   [20] J. Reynolds and J. Postel.  Assigned Numbers.  RFC 1700, October
        1994.

   [21] R. Rivest.  The MD5 Message-Digest Algorithm.  RFC 1321, April
        1992.

   [22] W. Simpson (Editor).  The Point-to-Point Protocol (PPP).  RFC
        1661, July 1994.



Perkins, editor             Expires 21 April 1994              [Page 41]

Internet Draft            IP Mobility Support            21 October 1994


Chair's Addresses

   The working group can be contacted via the current chairs:

          Kannan Alagappan                  Tony Li
                                            170 W. Tasman Dr.
                                            San Jose CA 95134

          Work:   +1 222 3334444            Work:   +1 408 5268186
          E-mail: kannan@emc.com            E-mail: tli@cisco.com


Editor's Address

   Questions about this memo can also be directed to:

          Charles Perkins
          Room J1-A25
          T. J. Watson Research Center
          IBM Corporation
          P. O. Box 218
          Yorktown Heights, NY  10598

          Work:  +1 914 7847350
          Fax:   +1 914 7847007
          E-mail: perk@watson.ibm.com

























Perkins, editor             Expires 21 April 1994              [Page 42]
